In [28]:
import pandas as pd
import numpy as np

In [12]:
df=pd.read_csv('hari.csv',header=None)
df.head()

              0    1       2            3
0          name  age  salary  designation
1   hari shayam   23   85000            M
2    hari gopal   40   36000          ASM
3          hari  NaN   65465          NaN
4         raman   35                   DM

In [13]:
df=pd.read_csv('hari.csv',header=None,skiprows=1)
df.head()

              0     1      2     3
0   hari shayam  23.0  85000     M
1    hari gopal  40.0  36000   ASM
2          hari   NaN  65465   NaN
3         raman  35.0           DM
4         tarun   NaN    NaN   NaN

In [54]:
df.isnull()

   2019-09-24  2019-09-25  2019-09-26  2019-09-27
A       False       False       False       False
B       False       False       False       False
C       False       False       False       False
D       False       False       False       False

In [55]:
df.isna()

   2019-09-24  2019-09-25  2019-09-26  2019-09-27
A       False       False       False       False
B       False       False       False       False
C       False       False       False       False
D       False       False       False       False

In [15]:
df.isnull().count()

0    8
1    8
2    8
3    8
dtype: int64

In [16]:
df.isnull().sum()

0    0
1    2
2    1
3    3
dtype: int64

In [17]:
df.ffill(inplace=True)
df.head()

              0     1      2     3
0   hari shayam  23.0  85000     M
1    hari gopal  40.0  36000   ASM
2          hari  40.0  65465   ASM
3         raman  35.0           DM
4         tarun  35.0           DM

In [18]:
df.fillna(22,inplace=True)          #fill value where if finds NaN  value
df.head(5)

              0     1      2     3
0   hari shayam  23.0  85000     M
1    hari gopal  40.0  36000   ASM
2          hari  40.0  65465   ASM
3         raman  35.0           DM
4         tarun  35.0           DM

In [19]:
df.dropna(thresh=2,inplace=True)
df.head(7)

              0     1      2     3
0   hari shayam  23.0  85000     M
1    hari gopal  40.0  36000   ASM
2          hari  40.0  65465   ASM
3         raman  35.0           DM
4         tarun  35.0           DM
5        yogesh  34.0  22342    DM
6        ramesh  45.0  46666    RM

In [20]:
df.dropna(inplace=True)
df.head(7)

              0     1      2     3
0   hari shayam  23.0  85000     M
1    hari gopal  40.0  36000   ASM
2          hari  40.0  65465   ASM
3         raman  35.0           DM
4         tarun  35.0           DM
5        yogesh  34.0  22342    DM
6        ramesh  45.0  46666    RM

In [21]:
df.drop_duplicates()

              0     1      2     3
0   hari shayam  23.0  85000     M
1    hari gopal  40.0  36000   ASM
2          hari  40.0  65465   ASM
3         raman  35.0           DM
4         tarun  35.0           DM
5        yogesh  34.0  22342    DM
6        ramesh  45.0  46666    RM
7        kamran  33.0  35255    KM

In [22]:
df.iloc[:,1:3]                               #first one is row and second one is column(index)

      1      2
0  23.0  85000
1  40.0  36000
2  40.0  65465
3  35.0
4  35.0
5  34.0  22342
6  45.0  46666
7  33.0  35255

In [25]:
df.loc[:,1]                           #first is row index and second is column name (name)

0    23.0
1    40.0
2    40.0
3    35.0
4    35.0
5    34.0
6    45.0
7    33.0
Name: 1, dtype: float64

In [26]:
 dates=pd.date_range('20190924',periods=6)               #yyyymmdd
 dates

DatetimeIndex(['2019-09-24', '2019-09-25', '2019-09-26', '2019-09-27',
               '2019-09-28', '2019-09-29'],
              dtype='datetime64[ns]', freq='D')

In [29]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
print(df)

                   A         B         C         D
2019-09-24 -1.669734  0.988733  0.398737 -0.666804
2019-09-25 -1.840671  0.843954 -1.923502 -0.299640
2019-09-26 -0.638742 -0.251485  0.523334 -0.800808
2019-09-27  0.069130  0.232229  0.072605  0.301057
2019-09-28  0.111013  0.139363  0.460518  1.609872
2019-09-29  1.871398  0.193298  0.986422 -0.118494

In [32]:
df=pd.DataFrame(np.random.randn(6,5),index=dates,columns=['A','B','C','D','E']    # randn(6,5)  ----> 6=row and 5=column

SyntaxError: unexpected EOF while parsing (<ipython-input-32-3546b9b47e21>, line 1)

In [33]:
df2=pd.DataFrame({
    'A':1.,
    'B':pd.Timestamp('20190521'),
    'C':pd.Series(1,index=list(range(4))),
    'D':np.array([3]*4,dtype='int32'),
    'E':pd.Categorical(["test","train","test","train"]),
    'F':-1
})
df2
print(df2.index)

Int64Index([0, 1, 2, 3], dtype='int64')

In [34]:
df2.dtypes

A           float64
B    datetime64[ns]
C             int64
D             int32
E          category
F             int64
dtype: object

In [35]:
df.index

DatetimeIndex(['2019-09-24', '2019-09-25', '2019-09-26', '2019-09-27',
               '2019-09-28', '2019-09-29'],
              dtype='datetime64[ns]', freq='D')

In [36]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [37]:
df.values

array([[-1.66973387,  0.98873266,  0.39873702, -0.66680376],
       [-1.84067092,  0.84395368, -1.92350219, -0.29963994],
       [-0.63874224, -0.25148485,  0.52333442, -0.80080807],
       [ 0.06912951,  0.23222932,  0.07260515,  0.30105661],
       [ 0.11101301,  0.13936343,  0.46051828,  1.60987158],
       [ 1.87139782,  0.1932981 ,  0.98642165, -0.11849358]])

In [38]:
df.quantile()                            #print 3/4th data

A   -0.284806
B    0.212764
C    0.429628
D   -0.209067
Name: 0.5, dtype: float64

In [39]:
df.T                             #transpose

   2019-09-24  2019-09-25  2019-09-26  2019-09-27  2019-09-28  2019-09-29
A   -1.669734   -1.840671   -0.638742    0.069130    0.111013    1.871398
B    0.988733    0.843954   -0.251485    0.232229    0.139363    0.193298
C    0.398737   -1.923502    0.523334    0.072605    0.460518    0.986422
D   -0.666804   -0.299640   -0.800808    0.301057    1.609872   -0.118494

In [40]:
df.sort_index(axis=0,ascending=True)                 #axis=1 for column wise and axis=0 for row wise
                                                     #ascending=False means descending order

                   A         B         C         D
2019-09-24 -1.669734  0.988733  0.398737 -0.666804
2019-09-25 -1.840671  0.843954 -1.923502 -0.299640
2019-09-26 -0.638742 -0.251485  0.523334 -0.800808
2019-09-27  0.069130  0.232229  0.072605  0.301057
2019-09-28  0.111013  0.139363  0.460518  1.609872
2019-09-29  1.871398  0.193298  0.986422 -0.118494

In [41]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2019-09-24 -0.666804  0.398737  0.988733 -1.669734
2019-09-25 -0.299640 -1.923502  0.843954 -1.840671
2019-09-26 -0.800808  0.523334 -0.251485 -0.638742
2019-09-27  0.301057  0.072605  0.232229  0.069130
2019-09-28  1.609872  0.460518  0.139363  0.111013
2019-09-29 -0.118494  0.986422  0.193298  1.871398

In [42]:
dff=pd.DataFrame([[13,12,3],[2,3,4],[4,1,5]])
print(dff)
print(dff.sort_index(axis=0,ascending=True))

    0   1  2
0  13  12  3
1   2   3  4
2   4   1  5
    0   1  2
0  13  12  3
1   2   3  4
2   4   1  5

In [43]:
df.at[dates[0],'A']=1                            #date location
df

                   A         B         C         D
2019-09-24  1.000000  0.988733  0.398737 -0.666804
2019-09-25 -1.840671  0.843954 -1.923502 -0.299640
2019-09-26 -0.638742 -0.251485  0.523334 -0.800808
2019-09-27  0.069130  0.232229  0.072605  0.301057
2019-09-28  0.111013  0.139363  0.460518  1.609872
2019-09-29  1.871398  0.193298  0.986422 -0.118494

In [44]:
df.iat[0,3]=7              #index location

In [45]:
df
df.to_csv('sss.csv')        # to_csv for new csv file

In [46]:
 dates=pd.date_range('20190924',periods=4) 
df=pd.DataFrame(np.random.randn(4,4),index=dates,columns=list('ABCD'))
print(df)

                   A         B         C         D
2019-09-24  1.290585 -0.020791 -0.594703  1.095367
2019-09-25 -2.288423  1.857581 -0.650871 -1.469179
2019-09-26 -0.828368  1.944021  0.654256 -1.070822
2019-09-27  0.169542 -1.397266  0.237758  1.815504

In [47]:
df.to_csv('ss.csv')

In [48]:
 dates=pd.date_range('20190924',periods=4) 
df=pd.DataFrame(np.random.randn(4,4),index=list('ABCD'),columns=dates)
print(df)

   2019-09-24  2019-09-25  2019-09-26  2019-09-27
A    0.987473    0.527117    0.888654    0.287464
B   -0.470670    0.569762   -0.265080   -0.351668
C   -0.503986   -0.287972    0.552927    0.395109
D    0.267628    0.769589   -0.079933    1.164913

In [49]:
data1=pd.read_excel('s1.xlsx',names=['names','age','salary'],header=None)
data1.head()

   names  age  salary
0      1   12   10000
1      2   23   34345
2      3   45   66555
3      4   34   45000
4      5   56   55000

In [50]:
data2=pd.read_excel('s2.xlsx',names=['name' , 'age','salary'],header=None)
data2.head()

   name  age  salary
0     1  NaN     NaN
1     2  NaN     NaN
2     3  NaN     NaN
3     8  NaN     NaN

In [51]:
for x in range(len(data1)):
    for y in range(len(data2)):
        if data1.iloc[x,0]==data2.iloc[y,0]:
            data2.iloc[y,1]=data1.iloc[x,1]
            data2.iloc[y,2]=data1.iloc[x,2]
data2.head()

   name   age   salary
0     1  12.0  10000.0
1     2  23.0  34345.0
2     3  45.0  66555.0
3     8  34.0  23000.0

In [52]:
for x in range(len(data1)):
    z=data1.iloc[x,:]
    len(z)
    for y in range(len(data2)):
        if data1.iloc[x,0]==data2.iloc[y,0]:
            for k in range(len(z)):
                data2.iloc[y,k]=data1.iloc[x,k]
                data2.iloc[y,k]=data1.iloc[x,k]
data2.head()

   name   age   salary
0     1  12.0  10000.0
1     2  23.0  34345.0
2     3  45.0  66555.0
3     8  34.0  23000.0

In [53]:
a=int(input())
for x in range(len(data1)):
    #z=data1.iloc[x,:]
    #len(z)
    if data1.iloc[x,0]==a:
     #   for k in range(len(z)):
        print(data1.iloc[x,1])
        print(data1.iloc[x,2])
        break               
    else:
        pass
            #data2.iloc[y,2]=data1.iloc[x,2] 
#print(data2)

3
45
66555